In [1]:
import pandas as pd

In [5]:
# pd.read_csv('../Home/Bangalore_Retailers_V3.xlsx')
pd.__version__

u'0.22.0'

In [2]:
dfs = pd.read_excel('Bangalore_Retailers_V3.xlsx', sheet_name=None, usecols="A,b",nrows=10)
# type(dfs)
len(dfs)

1

In [3]:
dfs

OrderedDict([(u'Carlsberg_Bangalore_Retailers_F',
                   Seller_Name  Retailer_Code
              0       Seller_1  431TCRCC03682
              1       Seller_1  431TCRCC03688
              2       Seller_1  431TCRBB03653
              3       Seller_1  431TCRCC03695
              4       Seller_1  431TCRBB03660
              5       Seller_1  431TCRAA03643
              6       Seller_1  431TCRCC03684
              7       Seller_1  431TCRAA03652
              8       Seller_1  431TCRCC03697
              9       Seller_1  431TCRBB03676
              10      Seller_1  431TCRBB03662
              11      Seller_1  431TCRAA03629
              12      Seller_1  431TCRBB03666
              13      Seller_1  431TCRCC03710
              14      Seller_1  431TCRCC03690
              15      Seller_1  431TCRBB03675
              16      Seller_1  431TCRCC03699
              17      Seller_1  431TCRBB03661
              18      Seller_1  431TCRAA03644
              19      Seller_1  431TCOPR01562
              20      Seller_1  431TCOPR01530
              21      Seller_1  431TCOPR01571
              22      Seller_1  431TCOPR01518
              23      Seller_1  431TCOPR01505
              24      Seller_1  431TCOPR01510
              25      Seller_1  431TCOPR01516
              26      Seller_1  431TCRCC03686
              27      Seller_1  431TCRBB03677
              28      Seller_1  431TCRBB03657
              29      Seller_1  431TCRAA03635
              ...          ...            ...
              1525   Seller_13  431TCRBB04622
              1526   Seller_13  431TCRBB04623
              1527   Seller_13  431TCRBB04581
              1528   Seller_13  431TCRBB04645
              1529   Seller_13  431TCRBB04611
              1530   Seller_13  431TCRBB04648
              1531   Seller_13  431TCRBB04613
              1532   Seller_13  431TCRBB04615
              1533   Seller_13  431TCOPR04624
              1534   Seller_13  431TCOPR04614
              1535   Seller_13  431TCRBB04600
              1536   Seller_13  431TCOPR04625
              1537   Seller_13  431TCOPR04617
              1538   Seller_13  431TCOPR04618
              1539   Seller_13  431TCOPR04619
              1540   Seller_13  431TCOPR04620
              1541   Seller_13  431TCRBB04638
              1542   Seller_13  431TCRBB04621
              1543   Seller_13  431TCRBB04646
              1544   Seller_13  431TCRBB04644
              1545   Seller_13  431TCOPR04659
              1546   Seller_13  431TCOPR04592
              1547   Seller_13  431TCOPR04591
              1548   Seller_13  431TCRBB04584
              1549   Seller_13  431TCOPR04593
              1550   Seller_13  431TCOPR04583
              1551   Seller_13  431TCRBB04588
              1552   Seller_13  431TCOPR04586
              1553   Seller_13  431TCRCC03621
              1554   Seller_13  431TCRCC03626

              [1555 rows x 2 columns])])

In [4]:
# sheet=dfs.worksheet[0]
len(dfs)

1

In [6]:
df1=pd.DataFrame([['Ajay','Male',38],['Rakesh','Male',29],['Ritika','Female',25]],
                columns=['Name','Sex','Age'],index=['x1','x2','x3'])
df1

      Name     Sex  Age
x1    Ajay    Male   38
x2  Rakesh    Male   29
x3  Ritika  Female   25

In [10]:
data={'Name':['Ajay','Bijay'],'Age':[22,24]}
df2=pd.DataFrame(data,index=['rank1','rank2'],dtype=float)
df2

        Age   Name
rank1  22.0   Ajay
rank2  24.0  Bijay

In [29]:
data2=[{'Name':'Ajay','Age':24},{'Name':'Akash','Sex':'Male','Nationality':'India','Age':25},
       {'Name':'Alex','Sex':'Male','Age':32,'Nationality':'USA'}]
df3=pd.DataFrame(data2,index=[1,2,3],columns=['Name','Age','Nationality','Sex'])
df3

    Name  Age Nationality   Sex
1   Ajay   24         NaN   NaN
2  Akash   25       India  Male
3   Alex   32         USA  Male

In [27]:
df3.iloc[-2]

Name           Akash
Age               25
Nationality    India
Sex             Male
Name: 12, dtype: object

In [35]:
df3.iloc[[0,-3]]

   Name  Age Nationality  Sex
1  Ajay   24         NaN  NaN
1  Ajay   24         NaN  NaN

In [42]:
df3.loc[[1,2],['Name','Age']]

    Name  Age
1   Ajay   24
2  Akash   25

In [39]:
df3.iloc[[1,2],[0,1]]

    Name  Age
2  Akash   25
3   Alex   32

In [44]:
Age_Mean = df3['Age'].mean()
Age_Mean

27.0

In [43]:
df3

    Name  Age Nationality   Sex
1   Ajay   24         NaN   NaN
2  Akash   25       India  Male
3   Alex   32         USA  Male

In [45]:
df3.loc[df3['Age']>Age_Mean,:]

   Name  Age Nationality   Sex
3  Alex   32         USA  Male

In [46]:
df3.groupby('Nationality')['Age'].mean()

Nationality
India    25
USA      32
Name: Age, dtype: int64

In [47]:
df3['Age']

1    24
2    25
3    32
Name: Age, dtype: int64

In [48]:
df3.groupby('Nationality')['Age'].mean()

Nationality
India    25
USA      32
Name: Age, dtype: int64